# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  # m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  # l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  # x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
  # 640*640*3
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 1]]  # 0-P1/2    640*640*64
  - [-1, 1, Conv, [128, 3, 1]]  # 1-P2/4   640*640*128
  - [-1, 1, SPD, [1]]  # 2 -P2/4           320*320*256
  - [-1, 3, C2f, [128, True]] #  3          320*320*128
  - [-1, 1, Conv, [256, 3, 1]]  # 4-P3/8   320*320*256
  - [-1, 1, SPD, [1]]  # 5                 160*160*512
  - [-1, 6, C2f, [256, True]] # 6           160*160*256
  - [-1, 1, Conv, [512, 3, 1]]  # 7-P4/16  160*160*512
  - [-1, 1, SPD, [1]]  # 8                 80*80*1024
  - [-1, 6, C2f, [512, True]] # 9           80*80*512
  - [-1, 1, Conv, [1024, 3, 1]]  #10-P5/32 80*80*1024
  - [-1, 1, SPD, [1]]  # 11                40*40*2048
  - [-1, 3, C2f, [1024, True]] #12         40*40*2048
  - [-1, 1, SPPF, [1024, 5]]  # 13         40*40*1024

 #YOLOv8.0n head
head:
  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ]   #   80*80*1024
  - [ [ -1, 9 ], 1, Concat, [ 1 ] ] # cat backbone P4  # 80*80*1536
  - [ -1, 3, C2f, [ 512 ] ] # 16                         80*80*512

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] #     160*160*512
  - [ [ -1, 6 ], 1, Concat, [ 1 ] ] # cat backbone P3    160*160*768
  - [ -1, 3, C2f, [ 256 ] ] # 19 (P3/8-small)            160*160*256

  - [ -1, 1, nn.Upsample, [ None, 2, "nearest" ] ] #     320*320*256
  - [ [ -1, 3 ], 1, Concat, [ 1 ] ] # cat backbone P3    320*320*384
  - [ -1, 3, C2f, [ 128 ] ] # 22 (P3/8-small)            320*320*128

  - [ -1, 1, Conv, [ 256, 3, 1 ] ]                  #    320*320*256
  - [-1, 1, SPD, [1]]                               #    160*160*512
  - [ [ -1, 19 ], 1, Concat, [ 1 ] ] # cat backbone P3   160*160*768
  - [ -1, 3, C2f, [ 256 ] ] # 25 (P3/8-small)            160*160*256

  - [ -1, 1, Conv, [ 512, 3, 1 ] ]                     # 160*160*512
  - [-1, 1, SPD, [1]]    #                               80*80*1024
  - [ [ -1, 16 ], 1, Concat, [ 1 ] ] # cat head P4     # 80*80*1536
  - [ -1, 3, C2f, [ 512 ] ] # 29 (P4/16-medium)       #  80*80**512

  - [ -1, 1, Conv, [ 1024, 3, 1 ] ]                   #  80*80*1024
  - [-1, 1, SPD, [1]]  #                                 40*40*2048
  - [ [ -1, 13 ], 1, Concat, [ 1 ] ] # cat head P5  #    40*40*3072
  - [ -1, 3, C2f, [ 1024 ] ] # 33 (P5/32-large)       #  40*40*1024

  - [ [22 , 25, 29, 33 ], 1, Detect, [ nc ] ] # Detect(P2, P3, P4, P5)

  # https://kns.cnki.net/kcms2/article/abstract?v=F7lgbn8YeJru5tR36nBqMkNEod7TKU-IOMhKsILTa2iCuenH1QPiHLzjNypvsWrSJaAwXpz3Q0XL4IMh-GGw6Tm5e9DsgRu5_ayDego4iFPjAOMCDe5cYKfMUtiytp4pGCNX5dEVr8W3LNECFtDXdp8dHOkpjBFtQ6d4P3hv9fy_chA47fIkjr1KtwbL8Bzn&uniplatform=NZKPT&language=CHS


